{ "schemaUri": "http://release.niem.gov/niem/domains/surfaceTransportation/3.2/", "documentation": ["Surface Transportation"],"components": {"BridgeStructure": { "type": "element", "documentation": [
    
      "A bridge, underpass, overpass, or tunnel bridge/structure that is also linkable to the national bridge inventory."
    
  ]},"IntersectionCategory": { "type": "element", "documentation": [
    
      "A data concept for an intersection consists of two or more roadways."
    
  ]},"IntersectionCategoryCode": { "type": "element", "documentation": [
    
      "An intersection consists of two or more roadways."
    
  ]},"LocationRoadway": { "type": "element", "documentation": [
    
      "A part of the roadway where Traffic Accident occurred."
    
  ]},"LocationRoadwayAugmentationPoint": { "type": "element", "documentation": [
    
      "An augmentation point for LocationRoadwayType."
    
  ]},"RoadwayAccessControl": { "type": "element", "documentation": [
    
      "A data concept for a degree that access to abutting land is fully, partially or not controlled by a public authority."
    
  ]},"RoadwayAccessControlCode": { "type": "element", "documentation": [
    
      "A degree that access to abutting land is fully, partially or not controlled by a public authority."
    
  ]},"RoadwayAnnualAverageDailyTraffic": { "type": "element", "documentation": [
    
      "An average number of motor vehicles passing a point on a trafficway in a day, for all days of the year, during a specified calendar year."
    
  ]},"RoadwayAnnualAverageDailyTrafficAugmentationPoint": { "type": "element", "documentation": [
    
      "An augmentation point for RoadwayAnnualAverageDailyTrafficType."
    
  ]},"RoadwayAnnualAverageDailyTrafficQuantity": { "type": "element", "documentation": [
    
      "A AADT number for a specific calendar year, in Motor Vehicles Per Day."
    
  ]},"RoadwayAnnualAverageDailyTrafficYearDate": { "type": "element", "documentation": [
    
      "A calendar year when AADT was calculated."
    
  ]},"RoadwayCurveApplicableIndicator": { "type": "element", "documentation": [
    
      "True if road curvature measurement parameters are applicable to this particular road part; false otherwise."
    
  ]},"RoadwayCurveLengthMeasure": { "type": "element", "documentation": [
    
      "A measurement of the curvature in the roadway expressed in terms of its length (use feet or meters)."
    
  ]},"RoadwayCurveRadiusLengthMeasure": { "type": "element", "documentation": [
    
      "A measurement of the curvature in the roadway expressed in terms of its radius (use feet or meters)."
    
  ]},"RoadwayCurveSuperelevationMeasure": { "type": "element", "documentation": [
    
      "A measurement of the curvature in the roadway expressed in terms of its superelevation (use feet or meters)."
    
  ]},"RoadwayFunctionalClass": { "type": "element", "documentation": [
    
      "A data concept for a character of service or function of streets or highways. The classification of rural and urban is determined by state and local officials in cooperation with each other and approved by the Federal Highway Administration, U.S. Department of Transportation."
    
  ]},"RoadwayFunctionalClassCode": { "type": "element", "documentation": [
    
      "A character of service or function of streets or highways. The classification of rural and urban is determined by state and local officials in cooperation with each other and approved by the Federal Highway Administration, U.S. Department of Transportat"
    
  ]},"RoadwayGrade": { "type": "element", "documentation": [
    
      "A data concept for a geometric or layout and inclination characteristics of the roadway in the direction of travel for this vehicle."
    
  ]},"RoadwayGradeCode": { "type": "element", "documentation": [
    
      "A geometric or layout and inclination characteristics of the roadway in the direction of travel for this vehicle."
    
  ]},"RoadwayGradeSlopePercent": { "type": "element", "documentation": [
    
      "An inclination of the roadway, expressed in the rate of rise or fall in feet (meters) per 100 feet (meters) of horizontal distance."
    
  ]},"RoadwayHorizontalAlignment": { "type": "element", "documentation": [
    
      "A data concept for a Horizontal Alignment. The geometric or layout and inclination characteristics of the roadway in the direction of travel for this vehicle."
    
  ]},"RoadwayHorizontalAlignmentCode": { "type": "element", "documentation": [
    
      "A Horizontal Alignment. The geometric or layout and inclination characteristics of the roadway in the direction of travel for this vehicle."
    
  ]},"RoadwayInclinationValue": { "type": "element", "documentation": [
    
      "An inclination of the roadway, expressed in the rate of rise or fall in feet (meters) per 100 feet (meters) of horizontal distance."
    
  ]},"RoadwayIntersectionAnnualAverageDailyTraffic": { "type": "element", "documentation": [
    
      "A total entering vehicles for all approaches of an intersection. Actual or estimated traffic volume expressed as an average annual daily count."
    
  ]},"RoadwayIntersectionAverageAnnualDailyEnteringTrafficQuantity": { "type": "element", "documentation": [
    
      "A total number of entering vehicles for all approaches of an intersection. Actual or estimated traffic volume expressed as an average annual daily count."
    
  ]},"RoadwayIntersectionTrafficControlCategory": { "type": "element", "documentation": [
    
      "A data concept for a type of traffic control device at intersection where crash occurred."
    
  ]},"RoadwayIntersectionTrafficControlCategoryCode": { "type": "element", "documentation": [
    
      "A type of traffic control device at intersection where crash occurred."
    
  ]},"RoadwayLaneWidthMeasure": { "type": "element", "documentation": [
    
      "A width of the lane(s) where crash occurred (use feet or meters)."
    
  ]},"RoadwayLighting": { "type": "element", "documentation": [
    
      "A data concept for a type of roadway illumination."
    
  ]},"RoadwayLightingCode": { "type": "element", "documentation": [
    
      "A type of roadway illumination."
    
  ]},"RoadwayMedianWidthMeasure": { "type": "element", "documentation": [
    
      "A width of portion of divided highway separating the road for traffic in opposing directions where the crash occurred. If a crash occurs at a mid-block section, the median width is based on the mid-block section. If the crash occurs at an intersection, the"
    
  ]},"RoadwayNationalHighwayPart": { "type": "element", "documentation": [
    
      "A data concept for a designation of the roadway as part of the National Highway System."
    
  ]},"RoadwayNationalHighwayPartCode": { "type": "element", "documentation": [
    
      "A designation of the roadway as part of the National Highway System."
    
  ]},"RoadwayRailwayCrossingIdentification": { "type": "element", "documentation": [
    
      "A unique US DOT/AAR number assigned for identification purposes to a railroad crossing by a state highway agency in cooperation with the Federal Railroad Administration."
    
  ]},"RoadwayShoulderWidthMeasure": { "type": "element", "documentation": [
    
      "A widths of the shoulder(s) where crash occurred (use feet or meters)."
    
  ]},"RoadwayStructureIdentification": { "type": "element", "documentation": [
    
      "A unique federal inspection/inventory identification assigned to a bridge, underpass, overpass, or tunnel bridge/structure that is also linkable to the national bridge inventory."
    
  ]},"RoadwayTotalLanesQuantity": { "type": "element", "documentation": [
    
      "A total number of lanes in the roadway on which this motor vehicle was traveling. For undivided highways: Total 'Thru' Lanes in Both Directions (excluding designated turn lanes). For divided highways: Total 'Thru' Lanes for the Roadway"
    
  ]},"TrafficwayDescription": { "type": "element", "documentation": [
    
      "A data concept for an indication of whether or not the trafficway for this vehicle is divided and whether it serves one-way or two-way traffic."
    
  ]},"TrafficwayDescriptionCode": { "type": "element", "documentation": [
    
      "An indication of whether or not the trafficway for this vehicle is divided and whether it serves one-way or two-way traffic."
    
  ]},"LocationRoadwayType": { "type": "complexType", "documentation": ["A data type for the part of the roadway where a traffic accident occurred."]},"RoadWayPresenceBicycleFacilityCodeType": { "type": "complexType", "documentation": ["A data type for indication whether a facility is designated for the exclusive use of bicycles or are to be shared with other transportation modes."]},"RoadWayPresenceBicycleSignedBicycleRouteCodeType": { "type": "complexType", "documentation": ["A data type for any road, path, or way which is specifically designated as being open to bicycle travel."]},"RoadwayAccessControlCodeType": { "type": "complexType", "documentation": ["A data type for the degree that access to abutting land is fully, partially or not controlled by a public authority."]},"RoadwayAnnualAverageDailyTrafficType": { "type": "complexType", "documentation": ["A data type for the average number of motor vehicles passing a point on a trafficway in a day, for all days of the year, during a specified calendar year."]},"RoadwayFunctionalClassCodeType": { "type": "complexType", "documentation": ["A data type for the character of service or function of streets or highways."]},"RoadwayIntersectionTrafficControlCategoryCodeType": { "type": "complexType", "documentation": ["A data type for a kind of traffic control device at intersection where crash occurred."]},"RoadwayLightingCodeType": { "type": "complexType", "documentation": ["A data type for a kind of roadway illumination."]},"RoadwayNumberLanesCodeType": { "type": "complexType", "documentation": ["A data type for number of through lanes on the side-road approaches at intersection including all lanes with through movement (through and left-turn, or through and rightturn) but not exclusive turn lanes."]},"RoadwayPavementLongitudinalMarkingCenterlinePresenceCodeType": { "type": "complexType", "documentation": ["A data type for Centerline Presence/Type on the roadway surface to guide or control the path followed by drivers."]},"RoadwayPavementLongitudinalMarkingEdgeLinePresenceCodeType": { "type": "complexType", "documentation": ["A data type for Edgeline Presence/Type on the roadway surface to guide or control the path followed by drivers."]},"RoadwayPavementLongitudinalMarkingLaneLineMarkingsCodeType": { "type": "complexType", "documentation": ["A data Type for Lane Line Markings used on the roadway surface to guide or control the path followed by drivers."]}}}